// Задача 4. Написать программу, которая
// принимает на вход натуральное число N, а 
// на выходе показывает его цифры через запятую.

//Console.Write("Введите натуральное число N: ");
//int n = int.Parse(Console.ReadLine()!);

